app/controllers/posts_controller.rb

  def create
    # byebug
    @post = Post.create(title: params[:post][:title], description: params[:post][:description])
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "fagsfjahsfjkahgf"], ["description", "glkjhljkhlk"], ["created_at", "2017-11-06 21:57:28.776121"], ["updated_at", "2017-11-06 21:57:28.776121"]]